source/.NET Standard/Unimake.Business.DFe/Servicos/Config/NFSe/AssuRN.xml

<?xml version="1.0" encoding="utf-8"?>
<Configuracoes>
	<Servicos ID="NFSe">
		<RecepcionarLoteRps versao="3.00">
			<Descricao>Recepcionar Lote RPS</Descricao>
			<WebEnderecoHomologacao>http://nfse-teste.publica.inf.br/homologa_nfse_integracao/Services?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://nfse-assu.e-publica.net/assu_nfse_integracao/Services?wsdl</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>schema_nfse_v03xsd</SchemaArquivo>
			<TagAssinatura>Rps</TagAssinatura>
			<TagAtributoID>InfRps</TagAtributoID>
			<TagLoteAssinatura>EnviarLoteRpsEnvio</TagLoteAssinatura>
			<TagLoteAtributoID>LoteRps</TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.nfse.integracao.ws.publica/"><soapenv:Header/><soapenv:Body><ser:RecepcionarLoteRps><XML>{xmlBodyScape}</XML></ser:RecepcionarLoteRps></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:RecepcionarLoteRpsResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>3.00</SchemaVersao>
			<TargetNS>http://www.publica.inf.br</TargetNS>
		</RecepcionarLoteRps>
		<GerarNfse versao="3.00">
			<Descricao>Gerar Nota Fiscal de Serviço</Descricao>
			<WebEnderecoHomologacao>http://nfse-teste.publica.inf.br/homologa_nfse_integracao/Services?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://nfse-assu.e-publica.net/assu_nfse_integracao/Services?wsdl</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao/>
			<SchemaArquivo>schema_nfse_v03.xsd</SchemaArquivo>
			<TagAssinatura>Rps</TagAssinatura>
			<TagAtributoID>InfRps</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.nfse.integracao.ws.publica/"><soapenv:Header/><soapenv:Body><ser:GerarNfse><XML>{xmlBodyScape}</XML></ser:GerarNfse></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:GerarNfseResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>3.00</SchemaVersao>
			<TargetNS>http://www.publica.inf.br</TargetNS>
		</GerarNfse>
		<CancelarNfse versao="3.00">
			<Descricao>Cancelar NFSe</Descricao>
			<WebEnderecoHomologacao>http://nfse-teste.publica.inf.br/homologa_nfse_integracao/Services?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://nfse-assu.e-publica.net/assu_nfse_integracao/Services?wsdl</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>schema_nfse_v03.xsd</SchemaArquivo>
			<TagAssinatura>Pedido</TagAssinatura>
			<TagAtributoID>InfPedidoCancelamento</TagAtributoID>
			<TagLoteAssinatura/>
			<TagLoteAtributoID/>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.nfse.integracao.ws.publica/"><soapenv:Header/><soapenv:Body><ser:CancelarNfse><XML>{xmlBodyScape}</XML></ser:CancelarNfse></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:CancelarNfseResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>3.00</SchemaVersao>
			<TargetNS>http://www.publica.inf.br</TargetNS>
		</CancelarNfse>
		<ConsultarLoteRps versao="3.00">
			<Descricao>Consultar Lote RPS</Descricao>
			<WebEnderecoHomologacao>http://nfse-teste.publica.inf.br/homologa_nfse_integracao/Services?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://nfse-assu.e-publica.net/assu_nfse_integracao/Services?wsdl</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo/>
			<TagAssinatura>ConsultarLoteRpsEnvio</TagAssinatura>
			<TagAtributoID>Prestador</TagAtributoID>
			<TagLoteAssinatura/>
			<TagLoteAtributoID/>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.nfse.integracao.ws.publica/"><soapenv:Header/><soapenv:Body><ser:ConsultarLoteRps><XML>{xmlBodyScape}</XML></ser:ConsultarLoteRps></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:ConsultarLoteRpsResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>3.00</SchemaVersao>
			<TargetNS>http://www.publica.inf.br</TargetNS>
		</ConsultarLoteRps>
		<ConsultarNfsePorRps versao="3.00">
			<Descricao>Consultar NFSe por RPS</Descricao>
			<WebEnderecoHomologacao>http://nfse-teste.publica.inf.br/homologa_nfse_integracao/Services?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://nfse-assu.e-publica.net/assu_nfse_integracao/Services?wsdl</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>schema_nfse_v03.xsd</SchemaArquivo>
			<TagAssinatura>ConsultarNfseRpsEnvio</TagAssinatura>
			<TagAtributoID>Prestador</TagAtributoID>
			<TagLoteAssinatura/>
			<TagLoteAtributoID/>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.nfse.integracao.ws.publica/"><soapenv:Header/><soapenv:Body><ser:ConsultarNfsePorRps><XML>{xmlBodyScape}</XML></ser:ConsultarNfsePorRps></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:ConsultarNfsePorRpsResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>3.00</SchemaVersao>
			<TargetNS>http://www.publica.inf.br</TargetNS>
		</ConsultarNfsePorRps>
		<ConsultarNfseFaixa versao="3.00">
			<Descricao>Consultar NFSe por faixa de numeração</Descricao>
			<WebEnderecoHomologacao>http://nfse-teste.publica.inf.br/homologa_nfse_integracao/Services?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://nfse-assu.e-publica.net/assu_nfse_integracao/Services?wsdl</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo/>
			<TagAssinatura>ConsultarNfseFaixaEnvio</TagAssinatura>
			<TagAtributoID>Prestador</TagAtributoID>
			<TagLoteAssinatura/>
			<TagLoteAtributoID/>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.nfse.integracao.ws.publica/"><soapenv:Header/><soapenv:Body><ser:ConsultarNfseFaixa><XML>{xmlBodyScape}</XML></ser:ConsultarNfseFaixa></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:ConsultarNfseFaixaResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>3.00</SchemaVersao>
			<TargetNS>http://www.publica.inf.br</TargetNS>
		</ConsultarNfseFaixa>
		<ConsultarSituacaoLoteRps versao="3.00">
			<Descricao>Consultar situação do lote RPS</Descricao>
			<WebEnderecoHomologacao>http://nfse-teste.publica.inf.br/homologa_nfse_integracao/Services?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://nfse-assu.e-publica.net/assu_nfse_integracao/Services?wsdl</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo/>
			<TagAssinatura>ConsultarSituacaoLoteRpsEnvio</TagAssinatura>
			<TagAtributoID>Prestador</TagAtributoID>
			<TagLoteAssinatura/>
			<TagLoteAtributoID/>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.nfse.integracao.ws.publica/"><soapenv:Header/><soapenv:Body><ser:ConsultarSituacaoLoteRps><XML>{xmlBodyScape}</XML></ser:ConsultarSituacaoLoteRps></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:ConsultarSituacaoLoteRpsResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>3.00</SchemaVersao>
			<TargetNS>http://www.publica.inf.br</TargetNS>
		</ConsultarSituacaoLoteRps>
	</Servicos>
</Configuracoes>